# 3. Написать функцию, аргументы имен сотрудников, возвращает словарь, ключи — первые буквы имён, 
# значения — списки, содержащие имена, начинающиеся с соответствующей буквы.

# in "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}


arguments = ["Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка", "Данил"]
key = ['А','Б','В','Г','Д','И','М','П','Н','О','С']
res = ''

def spisok(*params):
    spisok_list = [*params]
    
    res = dict.fromkeys([arguments[0] for arguments in spisok_list])
    for key in res:
        res[key] = list(filter(lambda n: n[0] == key, spisok_list))
    return(res) 

if True:
    new_spisok = spisok(*arguments)

print(new_spisok)








 











